insert into product (id, `type`, interest_rate, `name`, start_date, end_date, created_at, updated_at)
values (1, 'FIXED_SAVINGS', 4.2, '우리 SUPER 주거래 적금', '2024-01-01', '9999-12-31 23:59:59', '2024-01-01 00:00:00', '2024-01-01 00:00:00'),
       (2, 'DEPOSIT', 3.37, 'WON 플러스 예금', '2024-01-01', '9999-12-31 23:59:59', '2024-01-01 00:00:00', '2024-01-01 00:00:00'),
       (3, 'CHECKING', 0.1, '우리 SUPER 주거래 통장', '2024-01-01', '9999-12-31 23:59:59', '2024-01-01 00:00:00', '2024-01-01 00:00:00'),
       (4, 'FREE_SAVINGS', 4.0, '우리 SUPER 주거래 자유적금', '2024-01-01', '9999-12-31 23:59:59', '2024-01-01 00:00:00', '2024-01-01 00:00:00'),
       (5, 'CHECKING', 0.1, '우리 아이 행복 통장', '2024-01-01', '9999-12-31 23:59:59', '2024-01-01 00:00:00', '2024-01-01 00:00:00');

INSERT INTO baas_member (id, business_registration_number, company_name, email, password, address, phone, state, created_at, updated_at)
values (1, '123-45-67890', 'WeKids', 'wekids@wekids.co.kr', 'password', '서울 마포구 월드컵북로 434 상암 IT 타워', '02-1234-5678', 'ACTIVE', '2024-01-01 00:00:00', '2024-01-01 00:00:00');

INSERT INTO bank_member (id, `name`, birthday, resident_registration_number, `state`, baas_member_id, created_at, updated_at)
VALUES
    (1, '강현우', '2012-05-15', '120515-3234567', 'ACTIVE', 1, '2024-01-01 10:00:00', '2024-01-01 10:00:00'),
    (2, '구자빈', '2013-08-20', '130820-3234567', 'ACTIVE', 1, '2024-01-02 11:30:00', '2024-01-02 11:30:00'),
    (3, '안찬웅', '2014-12-01', '141201-3234567', 'ACTIVE', 1, '2024-01-03 09:00:00', '2024-01-03 09:00:00'),
    (4, '최윤정', '2015-07-25', '150725-4234567', 'ACTIVE', 1, '2024-01-04 14:20:00', '2024-01-04 14:20:00'),
    (5, '조예은', '2016-03-10', '160310-4234567', 'ACTIVE', 1, '2024-01-05 16:45:00', '2024-01-05 16:45:00'),
    (6, '이성희', '2017-11-18', '171118-3234567', 'ACTIVE', 1, '2024-01-06 13:10:00', '2024-01-06 13:10:00'),
    (7, '정성윤', '2012-09-05', '120905-3234567', 'ACTIVE', 1, '2024-01-07 12:00:00', '2024-01-07 12:00:00'),
    (8, '이현아', '2013-06-30', '130630-4234567', 'ACTIVE', 1, '2024-01-08 15:30:00', '2024-01-08 15:30:00'),
    (9, '정석진', '2014-02-22', '140222-3234567', 'ACTIVE', 1, '2024-01-09 08:45:00', '2024-01-09 08:45:00'),
    (10, '홍찬의', '2015-04-12', '150412-3234567', 'ACTIVE', 1, '2024-01-10 17:20:00', '2024-01-10 17:20:00');

INSERT INTO account (id, account_number, balance, password, expire_date, inactive_date, state, created_at, updated_at, product_id, bank_member_id, bank_code)
values (1, '1002913023908', 0.00, '1234', '9999-12-31 23:59:59', null, 'ACTIVE', '2024-11-18 15:57:03', '2024-11-18 15:57:03' , 5, 1, 'WOORI_BANK');
